[
    {
        "titleEn": "When waking up",
        "titleAr": "اذكأر الاستيقاظ من النوم",
        "adhkar": [
            {
                "descriptionEn": "\"All praise is for Allah who gave us life after having taken it from us and unto Him is the resurrection.\"",
                "descriptionAr": "الحَمْـدُ لِلّهِ الّذي أَحْـيانا بَعْـدَ ما أَماتَـنا وَإليه النُّـشور",
                "zikr": "Al-hamdu li-l-lâhi l-ladhî ahyânâ bacda mâ amâtanâ wa ilayhi n-nushûr.",
                "repeat": 1
            }
        ]
    },
    {
        "titleEn": "When waking up",
        "titleAr": "اذكأر الاستيقاظ من النوم",
        "adhkar": [
            {
                "descriptionEn": "\"None has the right to be worshipped except Allah, alone without associate, to Him belongs sovereignty and praise and He is over all things wholly capable. How perfect Allah is, and all praise is for Allah, and none has the right to be worshipped except Allah, Allah is the greatest and there is no power nor might except with Allah, The Most High, The Supreme. O my Lord forgive me.\"",
                "descriptionAr": "لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شَـريكَ له، لهُ المُلـكُ ولهُ الحَمـد، وهوَ على كلّ شيءٍ قدير، سُـبْحانَ اللهِ، والحمْـدُ لله ، ولا إلهَ إلاّ اللهُ واللهُ أكبَر، وَلا حَولَ وَلا قوّة إلاّ باللّهِ العليّ العظيم , رَبِّ اغْفرْ لي",
                "zikr": "Lâ ilâha illâ l-lâhu wahdahu lâ sharîka lahu, lahu-l-mulku wa lahu lhamdu, wa huwa calâ kulli shay’in qadîr. Subhâna l-lâhi, wa-l-hamdu li-l-lâhi, wa lâ ilâha illa l-lâhu, wa l-lâhu akbaru, wa lâ hawla wa lâ quwwata illa bi-l-lâhi-l-caliyyi-l-cazîm. Rabbi ghfir lî.",
                "repeat": 2
            }
        ]
    },
    {
        "titleEn": "When waking up",
        "titleAr": "اذكأر الاستيقاظ من النوم",
        "adhkar": [
            {
                "descriptionEn": "\"All praise is for Allah who restored to me my health and returned my soul and has allowed me to remember Him.\"",
                "descriptionAr": "الحمدُ للهِ الذي عافاني في جَسَدي وَرَدّ عَليّ روحي وَأَذِنَ لي بِذِكْرِه",
                "zikr": "Al hamdu li-l-lâhi l-ladhî câfânî fî jasadî wa radda calayya rûhî, wa adhina lî bi-dhikrihi.",
                "repeat": 3
            }
        ]
    },
    {
        "titleEn": "When wearing a garment",
        "titleAr": "دعاء لبس الثوب",
        "adhkar": [
            {
                "descriptionEn": "\"All Praise is for Allah who has clothed me with this garment and provided it for me, with no power nor might from myself.\"",
                "descriptionAr": "الحمدُ للهِ الّذي كَساني هذا (الثّوب) وَرَزَقَنيه مِنْ غَـيـْرِ حَولٍ مِنّي وَلا قـوّة",
                "zikr": "Al hamdu li-l-lâhi l-ladhî kasânî hadhâ th-thawbawa razaqanîhi min ghayri hawlin minnî wa lâ quwwatin.",
                "repeat": 1
            }
        ]
    },
    {
        "titleEn": "When wearing a new garment",
        "titleAr": "دعاء لبس الثوب الجديد",
        "adhkar": [
            {
                "descriptionEn": "\"O Allah, for You is all praise, You have clothed me with it (i.e. the garment), I ask You for the good of it and the good for which it was made, and I seek refuge with You from the evil of it and the evil for which it was made.\"",
                "descriptionAr": "اللّهُـمَّ لَـكَ الحَـمْـدُ أنْـتَ كَسَـوْتَنيهِ، أََسْأََلُـكَ مِـنْ خَـيرِهِ وَخَـيْرِ مَا صُنِعَ لَـه، وَأَعوذُ بِكَ مِـنْ شَـرِّهِ وَشَـرِّ مـا صُنِعَ لَـهُ",
                "zikr": "Allâhumma laka-l-hamdu. Anta kasawtanîhi. As’aluka min khayrihi wa khayri mâ sunica lahu, wa acudhu bika min sharrihi wa sharri mâ sunica lahu.",
                "repeat": 1
            }
        ]
    },
    {
        "titleEn": "To someone wearing a new garment",
        "titleAr": "الدعا لمن لبس ثوباً جديداً",
        "adhkar": [
            {
                "descriptionEn": "\"May you wear it out and Allah replace it (with another).\"",
                "descriptionAr": "تُبْـلي وَيُـخْلِفُ اللهُ تَعَالى",
                "zikr": "Tublî wa yukhlifu l-lâhu tacâlâ.",
                "repeat": 1
            }
        ]
    },
    {
        "titleEn": "To someone wearing a new garment",
        "titleAr": "الدعا لمن لبس ثوباً جديداً",
        "adhkar": [
            {
                "descriptionEn": "\"Wear anew, live commendably and die a shaheed.\"",
                "descriptionAr": "اِلبَـس جَديـداً وَعِـشْ حَمـيداً وَمُـتْ شهيداً",
                "zikr": "Ilbas jadîdan, wa cîsh hamîdan, wa mut shahîdan.",
                "repeat": 2
            }
        ]
    },
    {
        "titleEn": "Before undressing",
        "titleAr": "ما يقول إِذا وضع ثوبه",
        "adhkar": [
            {
                "descriptionEn": "\"In the name of Allah.\"",
                "descriptionAr": "بِسْمِ الله",
                "zikr": "Bismi l-lâhi.",
                "repeat": 1
            }
        ]
    },
    {
        "titleEn": "Before entering the toilet",
        "titleAr": "دعاء دخول الخلاءِ",
        "adhkar": [
            {
                "descriptionEn": "\"(In the name of Allah). O Allah, I take refuge with you from all evil and evil-doers.\"",
                "descriptionAr": "سْمِ الله ) اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَائِثِ)",
                "zikr": "(Bismi l-lâhi). Allâhumma innî acûdhu bika mina-l-khubthi wa-l-khabâ’ith.",
                "repeat": 1
            }
        ]
    },
    {
        "titleEn": "After leaving the toilet",
        "titleAr": "دعاء خروج من الخلاءِ",
        "adhkar": [
            {
                "descriptionEn": "\"I ask You (Allah) for forgiveness.\"",
                "descriptionAr": "غُفْـرانَك",
                "zikr": "Ghufrânak.",
                "repeat": 1
            }
        ]
    },
    {
        "titleEn": "When starting ablution",
        "titleAr": "الذكر قبل الوضوءِ",
        "adhkar": [
            {
                "descriptionEn": "\"In the name of Allah.\"",
                "descriptionAr": "بِسْمِ الله",
                "zikr": "Bismi l-lâhi.",
                "repeat": 1
            }
        ]
    },
    {
        "titleEn": "Upon completing the ablution",
        "titleAr": "الذكر بعد الفراغ من الوضوءِ",
        "adhkar": [
            {
                "descriptionEn": "\"I bear witness that none has the right to be worshipped except Allah, alone without partner, and I bear witness that Muhammad is His slave and Messenger.\"",
                "descriptionAr": "أَشْهَدُ أَنْ لا إِلَـهَ إِلاّ اللهُ وَحْدَهُ لا شَريـكَ لَـهُ وَأَشْهَدُ أَنَّ مُحَمّـداً عَبْـدُهُ وَرَسـولُـه",
                "zikr": "Ash-hadu an lâ ilâha illa l-lâhu, wahdahu lâ sharîka lahu, wa ash-hadu anna Muhammadan cabdûhu wa rasûluhu.",
                "repeat": 1
            }
        ]
    },
    {
        "titleEn": "Upon completing the ablution",
        "titleAr": "الذكر بعد الفراغ من الوضوءِ",
        "adhkar": [
            {
                "descriptionEn": "\"O Allah, make me of those who return to You often in repentance and make me of those who remain clean and pure.",
                "descriptionAr": "اللّهُـمَّ اجْعَلنـي مِنَ التَّـوّابينَ وَاجْعَـلْني مِنَ المتَطَهّـرين الله أكبر",
                "zikr": "Allâhumma jcalnî mina t-tawwâbîna wa jcalnî mina-l-mutatahhirîn.",
                "repeat": 2
            }
        ]
    },
    {
        "titleEn": "Upon completing the ablution",
        "titleAr": "الذكر بعد الفراغ من الوضوءِ",
        "adhkar": [
            {
                "descriptionEn": "\"How perfect You are O Allah, and I praise You, I bear witness that none has the right to be worshipped except You, I seek Your forgiveness and turn in repentance to You.\"",
                "descriptionAr": "سُبْحـانَكَ اللّهُـمَّ وَبِحَمدِك أَشْهَـدُ أَنْ لا إِلهَ إِلاّ أَنْتَ أَسْتَغْفِرُكَ وَأَتوبُ إِلَـيْك",
                "zikr": "Subhânaka l-lâhumma wa bi-hamdika. Ash-hadu an lâ ilâha illâ anta, astaghfiruka wa atûbu ilayka.",
                "repeat": 3
            }
        ]
    },
    {
        "titleEn": "Upon leaving the home",
        "titleAr": "الذكر عند الخروج من المنزل",
        "adhkar": [
            {
                "descriptionEn": "\"[Upon leaving :] In the name of Allah, I place my trust in Allah, and there is no might nor power except with Allah.\"",
                "descriptionAr": "بِسْمِ اللهِ ، تَوَكَّلْـتُ عَلى اللهِ وَلا حَوْلَ وَلا قُـوَّةَ إِلاّ بِالله",
                "zikr": "Bismi l-lâhi, tawakkaltu calâ l-lâhi, wa lâ hawla wa lâ quwwata illâ bi-l-lâhi.",
                "repeat": 1
            }
        ]
    },
    {
        "titleEn": "Upon leaving the home",
        "titleAr": "الذكر عند الخروج من المنزل",
        "adhkar": [
            {
                "descriptionEn": "\"[When leaving :] O Allah, I take refuge with You lest I should stray or be led astray, or slip or be tripped, or oppress or be oppressed, or behave foolishly or be treated foolishly.\"",
                "descriptionAr": "اللّهُـمَّ إِنِّـي أَعـوذُ بِكَ أَنْ أَضِـلَّ أَوْ أُضَـل ، أَوْ أَزِلَّ أَوْ أُزَل ، أَوْ أَظْلِـمَ أَوْ أَُظْلَـم ، أَوْ أَجْهَلَ أَوْ يُـجْهَلَ عَلَـيّ",
                "zikr": "Allâhumma innî acûdhu bika an adilla aw udalla, aw azilla aw uzalla, aw azlima, aw uzlama, aw ajhala, aw yujhala calayya.",
                "repeat": 2
            }
        ]
    },
    {
        "titleEn": "Upon entering the home",
        "titleAr": "الذكر عند دخول المنزل",
        "adhkar": [
            {
                "descriptionEn": "\"[Upon entering] In the name of Allah we enter and in the name of Allah we leave, and upon our Lord we place our trust.\"",
                "descriptionAr": "بِسْـمِ اللهِ وَلَجْنـا، وَبِسْـمِ اللهِ خَـرَجْنـا، وَعَلـى رَبِّنـا تَوَكّلْـنا",
                "zikr": "Bismi l-lâhi walajnâ, wa bismi l-lâhi kharajnâ, wa calâ l-lâhi tawakkalnâ.",
                "repeat": 3
            }
        ]
    },
    {
        "titleEn": "When going to the mosque",
        "titleAr": "دعاءُ الذّهاب الى المسجد",
        "adhkar": [
            {
                "descriptionEn": "\"O Allah, place within my heart light, and upon my tongue light, and within my ears light, and within my eyes light, and place behind me light and in front of me light and above me light and beneath me light. O Allah, bestow upon me light.\"",
                "descriptionAr": "اللّهُـمَّ اجْعَـلْ فِي قَلْبـي نُوراً ، وَفي لِسَـانِي نُوراً، وَفِي سَمْعِي نُوراً, وَفِي بَصَرِيِ نُوراً, وَمِنْ فََوْقِي نُوراً , وَ مِنْ تَحْتِي نُوراً, وَ عَنْ يَمِينيِ نُوراَ, وعَنْ شِمَالِي نُوراً, وَمْن أَماَمِي نُوراً, وَمِنْ خَلْفيِ نُوراَ, واجْعَلْ فِي نَفْسِي نُوراً, وأَعْظِمْ لِي نُوراً, وَعظِّمْ لِي نُوراً, وَاجْعَلْ لِي نُوراً, واجْعَلنِي نُوراً, أللَّهُمَّ أَعْطِنِي نُوراً, واجْعَلْ فِي عَصَبِي نُوراً, وَفِي لَحْمِي نُوراً, وَفِي دَمِي نُوراً وَفِي شَعْرِي نُوراً, وفِي بَشَرِي نُوراً (أَللَّهُمَّ اجِعَلْ لِي نُوراً فِي قّبْرِي وَ نُوراَ فِي عِظاَمِي) (وَزِدْنِي نُوراً, وَزِدْنِي نُوراَ , وَزِدْنِي نُوراً) (وَهَبْ لِي نُوراً عَلَى نُوراً )",
                "zikr": "Allâhumma jcal fî qalbî nûran, wa fî lisânî nûran, wa fî samcî nûran, wa fî basarî nûran, wa min fawqî nûran, wa min tahtî nûran, wa can yamînî nûran, wa can shimâlî nûran, wa min amâmî nûran, wa min khalfî nûran. Wa jcal fî nafsî nûran, wa aczim lî nûran, wa cazzim lî nûran. Wa jcal lî nûran, wa jcalnî nûran. Allâhumma actinî nûran, wa jcal fî casabî nûran, wa fî lahmî nûran, wa fî damî nûran, wa fî shacrî nûran, wa fî basharî nûran.\n[Allâhumma jcal lî nûran fî qabrî, wa nûran fî cizâmî.]\n[Wa zidnî nûran, wa zidnî nûran, wa zidnî nûran.]\n[Wa hab lî nûran calâ nûr.]",
                "repeat": 1
            }
        ]
    }
]
